/*1. С какими интерфейсами мы уже сталкивались в предыдущих уроках? Обратите внимание на
уроки, в которых мы читали из стандартного ввода и писали в стандартный вывод.
	- да было сканирование ввода данных, в нескольких домашних работах
2. Посмотрите примеры кода в своём портфолио. Везде ли ошибки обрабатываются грамотно?
Хотите ли вы переписать какие-либо функции?
	- нет, не везде, во время написания их не знал о таких возможностях обработки ошибок,
	после уже понял что функция должна возвращать в ответе ошибку тк лучше делать обработку ошибки там где вызывается эта функция
со звездочкой задачу сделаю для себя если в дальнейщих домашних работах ен прийдется работать с интерфейсами
*/